examples/muu_oikeushenkilon_tunniste.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:fi:tulli:wsdl_root" xmlns:urn1="urn:iso:std:iso:20022:tech:xsd:head.001.001.01" xmlns:urn2="urn:iso:std:iso:20022:tech:xsd:auth.001.001.01">
    <soapenv:Header />
    <soapenv:Body>
        <urn:ApplicationRequest>
            <urn:AppHdr>
                <urn1:CharSet>UTF-8</urn1:CharSet>
                <urn1:Fr>
                    <urn1:OrgId>
                        <urn1:Id>
                            <urn1:OrgId>
                                <urn1:Othr>
                                    <urn1:Id>4873635-9</urn1:Id>
                                    <urn1:SchmeNm>
                                        <urn1:Cd>Y</urn1:Cd>
                                    </urn1:SchmeNm>
                                </urn1:Othr>
                            </urn1:OrgId>
                        </urn1:Id>
                    </urn1:OrgId>
                </urn1:Fr>
                <urn1:To>
                    <urn1:OrgId>
                        <urn1:Id>
                            <urn1:OrgId>
                                <urn1:Othr>
                                    <urn1:Id>0245442-8</urn1:Id>
                                    <urn1:SchmeNm>
                                        <urn1:Cd>Y</urn1:Cd>
                                    </urn1:SchmeNm>
                                </urn1:Othr>
                            </urn1:OrgId>
                        </urn1:Id>
                    </urn1:OrgId>
                </urn1:To>
                <urn1:BizMsgIdr>r6/bz9dlT567HVr5RDi8Zw==</urn1:BizMsgIdr>
                <urn1:MsgDefIdr>auth.001.001.01</urn1:MsgDefIdr>
                <urn1:CreDt>2019-09-24T07:31:11Z</urn1:CreDt>
            </urn:AppHdr>
            <urn:Document>
                <urn2:InfReqOpng>
                    <urn2:InvstgtnId>ABC1234</urn2:InvstgtnId>
                    <urn2:LglMndtBsis>
                        <urn2:Prgrph>testi</urn2:Prgrph>
                    </urn2:LglMndtBsis>
                    <urn2:CnfdtltySts>true</urn2:CnfdtltySts>
                    <urn2:InvstgtnPrd>
                        <urn2:Dt>
                            <urn2:FrDt>2016-01-01</urn2:FrDt>
                            <urn2:ToDt>2019-05-30</urn2:ToDt>
                        </urn2:Dt>
                    </urn2:InvstgtnPrd>
                    <urn2:SchCrit>
                        <urn2:CstmrId>
                            <urn2:Pty>
                                <urn2:Id>
                                    <urn2:OrgId>
                                        <urn2:Othr>
                                            <urn2:Id>DE3599123</urn2:Id>
                                            <urn2:SchmeNm>
                                                <urn2:Cd>OTHR</urn2:Cd>
                                            </urn2:SchmeNm>
                                        </urn2:Othr>
                                    </urn2:OrgId>
                                </urn2:Id>
                            </urn2:Pty>
                            <urn2:AuthrtyReq>
                                <urn2:Tp>
                                    <urn2:MsgNmId>auth.001.001.01</urn2:MsgNmId>
                                </urn2:Tp>
                                <urn2:InvstgtdRoles>
                                    <urn2:Cd>ALLP</urn2:Cd>
                                </urn2:InvstgtdRoles>
                            </urn2:AuthrtyReq>
                        </urn2:CstmrId>
                    </urn2:SchCrit>
                    <urn2:SplmtryData>
                        <urn2:Envlp>
                            <urn2:AuthorityInquiry>
                                <urn2:OfficialId>1234567</urn2:OfficialId>
                                <urn2:OfficialSuperiorId>2345678</urn2:OfficialSuperiorId>
                            </urn2:AuthorityInquiry>
                        </urn2:Envlp>
                    </urn2:SplmtryData>
                </urn2:InfReqOpng>
            </urn:Document>
        </urn:ApplicationRequest>
    </soapenv:Body>
</soapenv:Envelope>